use HusbandOfAnHour
insert  into dbo.[UserRole]
values
('0','admin'),
('1','worker'),
('2','client')

insert into dbo.[Status]
values 
('0','Электрик','0'),
('1','Плотник','0'),
('2','Сантехник','0')

INSERT INTO dbo.[Status] VALUES
(0, 'на проверке', 0),
(1, 'В работе', 0),
(2, 'Отменен', 0),
(3, 'Выполнен', 0);

INSERT INTO dbo.[UserRole] VALUES
(0, 'Админ'),
(1, 'Рабочий'),
(2, 'Клиент');

INSERT INTO dbo.[Specialization] VALUES
(0, 'Электрик', 0),
(1, 'Плотник', 0),
(2, 'Сантехник', 0),
(3, 'Маляр', 0),
(4, 'Плиточник', 0),
(5, 'Сборщик', 0),
(6, 'Монтажник', 0),
(7, 'Столяр', 0);

INSERT INTO dbo.[Services] VALUES
(0, 'Ремонт, замена, добавление розеток, выключателей', 0, 0),
(1, 'Навес светильника', 0, 0),
(2, 'Диагностика и устранение неисправностей в сети', 0, 0),
(3, 'Замена элеткропроводки', 0, 0),
(4, 'Замена замка', 1, 0),
(5, 'Сборка или ремонт мебели', 1, 0),
(6, 'Установка двери для домашних животных', 1, 0),
(7, 'Ремонт или замена смесителя, крана, душа', 2, 0),
(8, 'Установка раковины, ванной, унитаза', 2, 0),
(9, 'Устранение засоров', 2, 0),
(10, 'Покраска потолков, стен, мебели', 3, 0),
(11, 'Поклейка обоев', 3, 0),
(12, 'Отделка стен, пола, потолка плиткой', 4, 0),
(13, 'Укладка мозаики', 4, 0),
(14, 'Сборка мебели', 5, 0),
(15, 'Монтаж кронштейна для подвеса бытовой техники', 6, 0),
(16, 'Изготовление мебели и деталей  из дерева', 7, 0);

INSERT INTO dbo.[User] VALUES
(0, 0, 'София', 'Стрелова', NULL, NULL, 0),
(1, 0, 'Мария', 'Попова', NULL, NULL, 0),
(2, 1, 'Анатолий', 'Мирный', NULL, 0, 0),
(3, 1, 'Иван', 'Логинов', NULL, 1, 0),
(4, 1, 'Евгений', 'Петров', NULL, 2, 0),
(5, 1, 'Дмитрий', 'Смирнов', NULL, 3, 0),
(6, 1, 'Николай', 'Собчак', NULL, 4, 0),
(7, 1, 'Игорь', 'Иванов', NULL, 5, 0),
(8, 1, 'Михаил', 'Петухов', NULL, 6, 0),
(9, 1, 'Сергей', 'Тихонов', NULL, 7, 0),
(10, 2, 'Cветлана', 'Крылова', 123, NULL, 0),
(11, 2, 'Наталья', 'Павлова', 456, NULL, 0),
(12, 2, 'Татьяна', 'Стоянова', 789, NULL, 0);

INSERT INTO dbo.[Request] VALUES
(0, 2, 10, 0, '2023-02-07', 'Сизова ул. д. 10', 3, 'Поменять розетку'),
(1, 3, 11, 4, '2023-02-06', 'Попова ул. д. 20', 1, 'Замена замка'),
(2, 7, 12, 14, '2023-02-05', 'Мебельная ул. д. 55', 2, 'Сборка мебели');
