use HusbandOfAnHour

INSERT INTO dbo.[Status] VALUES
(N'на проверке', 0),
(N'В работе', 0),
(N'Отменен', 0),
(N'Принят', 0),
(N'Выполнен', 0);

INSERT INTO dbo.[UserRole] VALUES
(N'Админ', 0),
(N'Рабочий', 0),
(N'Клиент', 0);

INSERT INTO dbo.[Specialization] VALUES
(N'Электрик', 0),
(N'Плотник', 0),
(N'Сантехник', 0),
(N'Маляр', 0),
(N'Плиточник', 0),
(N'Сборщик', 0),
(N'Монтажник', 0),
(N'Столяр', 0);

INSERT INTO dbo.[Service] VALUES
(N'Ремонт выключателей', 1, 0),
(N'Навес светильника', 1, 0),
(N'Диагностика сети', 1, 0),
(N'Замена элеткропроводки', 1, 0),
(N'Замена замка', 2, 0),
(N'Сборка или ремонт мебели', 2, 0),
(N'Установка двери', 1, 0),
(N'Ремонт смесителя', 2, 0),
(N'Установка раковины', 2, 0),
(N'Устранение засоров', 2, 0),
(N'Покраска потолков', 3, 0),
(N'Поклейка обоев', 3, 0),
(N'Отделка стен плиткой', 4, 0),
(N'Укладка мозаики', 4, 0),
(N'Сборка мебели', 5, 0),
(N'Монтаж кронштейна', 6, 0),
(N'Изготовление мебели', 7, 0);

INSERT INTO dbo.[User] VALUES
(0, 0, N'София', N'Стрелова', NULL, NULL, 0),
(1, 0, N'Мария', N'Попова', NULL, NULL, 0),
(2, 1, N'Анатолий', N'Мирный', NULL, 0, 0),
(3, 1, N'Иван', N'Логинов', NULL, 1, 0),
(4, 1, N'Евгений', N'Петров', NULL, 2, 0),
(5, 1, N'Дмитрий', N'Смирнов', NULL, 3, 0),
(6, 1, N'Николай', N'Собчак', NULL, 4, 0),
(7, 1, N'Игорь', N'Иванов', NULL, 5, 0),
(8, 1, N'Михаил', N'Петухов', NULL, 6, 0),
(9, 1, N'Сергей', N'Тихонов', NULL, 7, 0),
(10, 2, N'Cветлана', N'Крылова', 123, NULL, 0),
(11, 2, N'Наталья', N'Павлова', 456, NULL, 0),
(12, 2, N'Татьяна', N'Стоянова', 789, NULL, 0);

INSERT INTO dbo.[Request] VALUES
(2, 10, 0, '2023-02-07', N'Сизова ул. д. 10', 3, N'Поменять розетку'),
(3, 11, 4, '2023-02-06', N'Попова ул. д. 20', 1, N'Замена замка'),
(7, 12, 14, '2023-02-05',N'Мебельная ул. д. 55', 2, N'Сборка мебели');
